# Parameters
nc: 80  # number of classes
depth_multiple: 1.33  # model depth multiple
width_multiple: 1.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 9
  ]

# YOLOv5 head
head:
  [[ -1, 1, DilatedEncoderv1, [512, 32] ], #10
   [[-1, 6], 1, Sum_p3_p2, [512]],  # cat backbone P4
   [[-1, 4], 1, Sum_p1out, [256]],
   [[-1, 11, 6], 1, Sum_p2out, [512]],
   [[-1, 10], 1, Sum_p3out, [1024]],  # 14

   [ [ -1, 13 ], 1, Sum_p3_p2, [ 512 ] ],
   [ [ -1, 12 ], 1, Sum_p1out, [ 256 ] ],
   [ [ -1, 15, 13 ], 1, Sum_p2out, [ 512 ] ],
   [ [ -1, 14 ], 1, Sum_p3out, [ 1024 ] ],  # 18

#   [ [ -1, 17 ], 1, Sum_p3_p2, [ 512 ] ],
#   [ [ -1, 16 ], 1, Sum_p1out, [ 256 ] ],
#   [ [ -1, 19, 17 ], 1, Sum_p2out, [ 512 ] ],
#   [ [ -1, 18 ], 1, Sum_p3out, [ 1024 ] ],  # 22

   [16, 3, C3, [256, False]],  # 23 (P3/8-small)
   [17, 3, C3, [512, False]],  # 24 (P4/16-medium)
   [18, 3, C3, [1024, False]],  # 25 (P5/32-large)

   [[19, 20, 21], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]